export const surveyData = [
    {
      "id": 1,
      "question": "[색채] 당신을 가장 잘 표현하는 색은?",
      "options": [
        { "text": "빨간색", "weights": { "우디": 1, "앰버": 1, "워터리": -2, "스파이시": 2, "레더": 2, "그린": -1 } },
        { "text": "노란색", "weights": { "시트러스": 2, "그린": 1, "플로럴": 1, "레더": -1, "프루티": 2 } },
        { "text": "초록색", "weights": { "시트러스": 1, "그린": 2, "우디": 1, "워터리": 1, "스파이시": -1, "레더": -1 } },
        { "text": "파란색", "weights": { "시트러스": 1, "플로럴": -1, "앰버": -1, "워터리": 2, "스파이시": -1 } },
        { "text": "보라색", "weights": { "그린": -1, "플로럴": 2, "머스크": 2, "앰버": 1, "스파이시": 1, "프루티": 1 } }
      ]
    },
    {
      "id": 2,
      "question": "[도형] 당신의 내면과 가장 닮은 도형은?",
      "options": [
        { "text": "삼각형", "weights": { "시트러스": 2, "그린": 1, "플로럴": -1, "머스크": -1, "스파이시": 2, "레더": 1, "프루티": 1 } },
        { "text": "원형", "weights": { "시트러스": -1, "플로럴": 2, "머스크": 2, "앰버": 2, "워터리": 1, "스파이시": -2, "레더": -1, "프루티": 2 } },
        { "text": "사각형", "weights": { "그린": 1, "우디": 2, "앰버": 1, "레더": 2, "프루티": -1 } }
      ]
    },
    {
      "id": 3,
      "question": "[질감] 나와 잘 어울리는 옷의 재질은?",
      "options": [
        { "text": "리넨", "weights": { "시트러스": 2, "그린": 2, "머스크": 1, "앰버": -1, "워터리": 1, "레더": -2 } },
        { "text": "실크", "weights": { "플로럴": 2, "머스크": 2, "앰버": 1, "워터리": 1, "레더": -1, "프루티": 1 } },
        { "text": "캐시미어", "weights": { "시트러스": -1, "그린": -1, "플로럴": 1, "우디": 1, "머스크": 2, "앰버": 2, "레더": 1 } },
        { "text": "레더", "weights": { "시트러스": -1, "플로럴": -1, "우디": 2, "앰버": 1, "워터리": -1, "스파이시": 2, "레더": 2, "프루티": -1 } }
      ]
    },
    {
      "id": 4,
      "question": "[소리] 당신의 마음이 가장 안정되는 소리는?",
      "options": [
        { "text": "고음", "weights": { "시트러스": 2, "그린": 1, "플로럴": 1, "우디": -1, "머스크": -1, "앰버": -1, "스파이시": 1, "레더": -2, "프루티": 2 } },
        { "text": "저음", "weights": { "시트러스": -2, "우디": 2, "머스크": 1, "앰버": 2, "워터리": -1, "레더": 2, "프루티": -1 } },
        { "text": "백색소음", "weights": { "시트러스": 1, "그린": 1, "머스크": 2, "워터리": 2, "스파이시": -1 } }
      ]
    },
    {
      "id": 5,
      "question": "[이미지] 타인에게 남기고 싶은 당신의 인상은?",
      "options": [
        { "text": "산뜻/깨끗", "weights": { "시트러스": 2, "그린": 1, "우디": -1, "머스크": 1, "앰버": -1, "워터리": 2, "스파이시": -1, "레더": -2, "프루티": 1 } },
        { "text": "지적/차분", "weights": { "그린": 1, "우디": 2, "앰버": 1, "스파이시": 1, "레더": 1, "프루티": -1 } },
        { "text": "매혹/성숙", "weights": { "시트러스": -1, "그린": -1, "플로럴": 2, "우디": 1, "머스크": 1, "앰버": 2, "스파이시": 2, "레더": 1 } },
        { "text": "다정/포근", "weights": { "시트러스": -1, "플로럴": 1, "머스크": 2, "앰버": 2, "워터리": 1, "스파이시": -2, "레더": -1, "프루티": 1 } }
      ]
    }
  ];