export const surveyData = [
  {
    "id": 0,
    "question": "이름을 입력해주세요",
    "type": "text",
    "placeholder": "여기에 이름을 입력하세요"
  },
  {
    "id": 1,
    "question": "[색채] 당신을 가장 잘 표현하는 색은?",
    "type": "select",
    "options": [
      { "text": "빨간색", "weights": { "우디": 1, "앰버": 1, "워터리": -2, "스파이시": 2, "레더": 2, "그린": -1, "시트러스": 0, "플로럴": 0, "머스크": 0, "프루티": 0 } },
      { "text": "노란색", "weights": { "시트러스": 2, "그린": 1, "플로럴": 1, "레더": -1, "프루티": 2, "우디": 0, "머스크": 0, "앰버": 0, "워터리": 0, "스파이시": 0 } },
      { "text": "초록색", "weights": { "시트러스": 1, "그린": 2, "우디": 1, "워터리": 1, "스파이시": -1, "레더": -1, "플로럴": 0, "머스크": 0, "앰버": 0, "프루티": 0 } },
      { "text": "파란색", "weights": { "시트러스": 1, "플로럴": -1, "앰버": -1, "워터리": 2, "스파이시": -1, "그린": 0, "우디": 0, "머스크": 0, "레더": 0, "프루티": 0 } },
      { "text": "보라색", "weights": { "그린": -1, "플로럴": 2, "머스크": 2, "앰버": 1, "스파이시": 1, "프루티": 1, "시트러스": 0, "우디": 0, "워터리": 0, "레더": 0 } }
    ]
  },
  {
    "id": 2,
    "question": "[도형] 당신의 내면과 가장 닮은 도형은?",
    "type": "select",
    "options": [
      { "text": "삼각형", "weights": { "시트러스": 2, "그린": 1, "플로럴": -1, "머스크": -1, "스파이시": 2, "레더": 1, "프루티": 1, "우디": 0, "앰버": 0, "워터리": 0 } },
      { "text": "원형", "weights": { "시트러스": -1, "플로럴": 2, "머스크": 2, "앰버": 2, "워터리": 1, "스파이시": -2, "레더": -1, "프루티": 2, "그린": 0, "우디": 0 } },
      { "text": "사각형", "weights": { "그린": 1, "우디": 2, "앰버": 1, "레더": 2, "프루티": -1, "시트러스": 0, "플로럴": 0, "머스크": 0, "워터리": 0, "스파이시": 0 } }
    ]
  },
  {
    "id": 3,
    "question": "[질감] 나와 잘 어울리는 옷의 재질은?",
    "type": "select",
    "options": [
      { "text": "리넨", "weights": { "시트러스": 2, "그린": 2, "머스크": 1, "앰버": -1, "워터리": 1, "레더": -2, "플로럴": 0, "우디": 0, "스파이시": 0, "프루티": 0 } },
      { "text": "실크", "weights": { "플로럴": 2, "머스크": 2, "앰버": 1, "워터리": 1, "레더": -1, "프루티": 1, "시트러스": 0, "그린": 0, "우디": 0, "스파이시": 0 } },
      { "text": "캐시미어", "weights": { "시트러스": -1, "그린": -1, "플로럴": 1, "우디": 1, "머스크": 2, "앰버": 2, "레더": 1, "워터리": 0, "스파이시": 0, "프루티": 0 } },
      { "text": "레더", "weights": { "시트러스": -1, "플로럴": -1, "우디": 2, "앰버": 1, "워터리": -1, "스파이시": 2, "레더": 2, "프루티": -1, "그린": 0, "머스크": 0 } }
    ]
  },
  {
    "id": 4,
    "question": "[소리] 당신의 마음이 가장 안정되는 소리는?",
    "type": "select",
    "options": [
      { "text": "고음", "weights": { "시트러스": 2, "그린": 1, "플로럴": 1, "우디": -1, "머스크": -1, "앰버": -1, "스파이시": 1, "레더": -2, "프루티": 2, "워터리": 0 } },
      { "text": "저음", "weights": { "시트러스": -2, "우디": 2, "머스크": 1, "앰버": 2, "워터리": -1, "레더": 2, "프루티": -1, "그린": 0, "플로럴": 0, "스파이시": 0 } },
      { "text": "백색소음", "weights": { "시트러스": 1, "그린": 1, "머스크": 2, "워터리": 2, "스파이시": -1, "플로럴": 0, "우디": 0, "앰버": 0, "레더": 0, "프루티": 0 } }
    ]
  },
  {
    "id": 5,
    "question": "[이미지] 타인에게 남기고 싶은 당신의 인상은?",
    "type": "select",
    "options": [
      { "text": "산뜻/깨끗", "weights": { "시트러스": 2, "그린": 1, "우디": -1, "머스크": 1, "앰버": -1, "워터리": 2, "스파이시": -1, "레더": -2, "프루티": 1, "플로럴": 0 } },
      { "text": "지적/차분", "weights": { "그린": 1, "우디": 2, "앰버": 1, "스파이सी": 1, "레더": 1, "프루티": -1, "시트러스": 0, "플로럴": 0, "머스크": 0, "워터리": 0 } },
      { "text": "매혹/성숙", "weights": { "시트러스": -1, "그린": -1, "플로럴": 2, "우디": 1, "머스크": 1, "앰버": 2, "스파이시": 2, "레더": 1, "워터리": 0, "프루티": 0 } },
      { "text": "다정/포근", "weights": { "시트러스": -1, "플로럴": 1, "머스크": 2, "앰버": 2, "워터리": 1, "스파이시": -2, "레더": -1, "프루티": 1, "그린": 0, "우디": 0 } }
    ]
  },
  {
    "id": 6,
    "question": "페이지6",
    "type": "select",
    "options": [
      { "text": "응답6-1", "weights": { "시트러스": 0, "그린": 0, "플로럴": 0, "우디": 0, "머스크": 0, "앰버": 0, "워터리": 0, "스파이시": 0, "레더": 0, "프루티": 0 } },
      { "text": "응답6-2", "weights": { "시트러스": 0, "그린": 0, "플로럴": 0, "우디": 0, "머스크": 0, "앰버": 0, "워터리": 0, "스파이시": 0, "레더": 0, "프루티": 0 } }
    ]
  },
  {
    "id": 7,
    "question": "페이지7",
    "type": "select",
    "options": [
      { "text": "응답7-1", "weights": { "시트러스": 0, "그린": 0, "플로럴": 0, "우디": 0, "머스크": 0, "앰버": 0, "워터리": 0, "스파이시": 0, "레더": 0, "프루티": 0 } },
      { "text": "응답7-2", "weights": { "시트러스": 0, "그린": 0, "플로럴": 0, "우디": 0, "머스크": 0, "앰버": 0, "워터리": 0, "스파이시": 0, "레더": 0, "프루티": 0 } }
    ]
  },
  {
    "id": 8,
    "question": "페이지8",
    "type": "select",
    "options": [
      { "text": "응답8-1", "weights": { "시트러스": 0, "그린": 0, "플로럴": 0, "우디": 0, "머스크": 0, "앰버": 0, "워터리": 0, "스파이시": 0, "레더": 0, "프루티": 0 } },
      { "text": "응답8-2", "weights": { "시트러스": 0, "그린": 0, "플로럴": 0, "우디": 0, "머스크": 0, "앰버": 0, "워터리": 0, "스파이시": 0, "레더": 0, "프루티": 0 } }
    ]
  },
  {
    "id": 9,
    "question": "페이지9",
    "type": "select",
    "options": [
      { "text": "응답9-1", "weights": { "시트러스": 0, "그린": 0, "플로럴": 0, "우디": 0, "머스크": 0, "앰버": 0, "워터리": 0, "스파이시": 0, "레더": 0, "프루티": 0 } },
      { "text": "응답9-2", "weights": { "시트러스": 0, "그린": 0, "플로럴": 0, "우디": 0, "머스크": 0, "앰버": 0, "워터리": 0, "스파이시": 0, "레더": 0, "프루티": 0 } }
    ]
  },
  {
    "id": 10,
    "question": "페이지10",
    "type": "select",
    "options": [
      { "text": "응답10-1", "weights": { "시트러스": 0, "그린": 0, "플로럴": 0, "우디": 0, "머스크": 0, "앰버": 0, "워터리": 0, "스파이시": 0, "레더": 0, "프루티": 0 } },
      { "text": "응답10-2", "weights": { "시트러스": 0, "그린": 0, "플로럴": 0, "우디": 0, "머스크": 0, "앰버": 0, "워터리": 0, "스파이시": 0, "레더": 0, "프루티": 0 } }
    ]
  },
  {
    "id": 11,
    "question": "페이지11",
    "type": "select",
    "options": [
      { "text": "응답11-1", "weights": { "시트러스": 0, "그린": 0, "플로럴": 0, "우디": 0, "머스크": 0, "앰버": 0, "워터리": 0, "스파이시": 0, "레더": 0, "프루티": 0 } },
      { "text": "응답11-2", "weights": { "시트러스": 0, "그린": 0, "플로럴": 0, "우디": 0, "머스크": 0, "앰버": 0, "워터리": 0, "스파이시": 0, "레더": 0, "프루티": 0 } }
    ]
  }
];